In [1]:
import sqlite3

In [2]:
sqlite3.version

'2.6.0'

In [3]:
dir(sqlite3)

['Binary',
 'Cache',
 'Connection',
 'Cursor',
 'DataError',
 'DatabaseError',
 'Date',
 'DateFromTicks',
 'Error',
 'IntegrityError',
 'InterfaceError',
 'InternalError',
 'NotSupportedError',
 'OperationalError',
 'OptimizedUnicode',
 'PARSE_COLNAMES',
 'PARSE_DECLTYPES',
 'PrepareProtocol',
 'ProgrammingError',
 'Row',
 'SQLITE_ALTER_TABLE',
 'SQLITE_ANALYZE',
 'SQLITE_ATTACH',
 'SQLITE_CREATE_INDEX',
 'SQLITE_CREATE_TABLE',
 'SQLITE_CREATE_TEMP_INDEX',
 'SQLITE_CREATE_TEMP_TABLE',
 'SQLITE_CREATE_TEMP_TRIGGER',
 'SQLITE_CREATE_TEMP_VIEW',
 'SQLITE_CREATE_TRIGGER',
 'SQLITE_CREATE_VIEW',
 'SQLITE_DELETE',
 'SQLITE_DENY',
 'SQLITE_DETACH',
 'SQLITE_DROP_INDEX',
 'SQLITE_DROP_TABLE',
 'SQLITE_DROP_TEMP_INDEX',
 'SQLITE_DROP_TEMP_TABLE',
 'SQLITE_DROP_TEMP_TRIGGER',
 'SQLITE_DROP_TEMP_VIEW',
 'SQLITE_DROP_TRIGGER',
 'SQLITE_DROP_VIEW',
 'SQLITE_IGNORE',
 'SQLITE_INSERT',
 'SQLITE_OK',
 'SQLITE_PRAGMA',
 'SQLITE_READ',
 'SQLITE_REINDEX',
 'SQLITE_SELECT',
 'SQLITE_TRANSACTION',
 'SQLITE_UPDATE',
 'Statement',
 'Time',
 'TimeFromTicks',
 'Timestamp',
 'TimestampFromTicks',
 'Warning',
 '__builtins__',
 '__cached__',
 '__doc__',
 '__file__',
 '__loader__',
 '__name__',
 '__package__',
 '__path__',
 '__spec__',
 'adapt',
 'adapters',
 'apilevel',
 'collections',
 'complete_statement',
 'connect',
 'converters',
 'datetime',
 'dbapi2',
 'enable_callback_tracebacks',
 'enable_shared_cache',
 'paramstyle',
 'register_adapter',
 'register_converter',
 'sqlite_version',
 'sqlite_version_info',
 'threadsafety',
 'time',
 'version',
 'version_info']

In [5]:
sqlite3.version_info

(2, 6, 0)

In [7]:
sqlite3.sqlite_version

'3.21.0'

In [8]:
conn=sqlite3.connect(':memory:')

In [9]:
dir(conn)

['DataError',
 'DatabaseError',
 'Error',
 'IntegrityError',
 'InterfaceError',
 'InternalError',
 'NotSupportedError',
 'OperationalError',
 'ProgrammingError',
 'Warning',
 '__call__',
 '__class__',
 '__delattr__',
 '__dir__',
 '__doc__',
 '__enter__',
 '__eq__',
 '__exit__',
 '__format__',
 '__ge__',
 '__getattribute__',
 '__gt__',
 '__hash__',
 '__init__',
 '__init_subclass__',
 '__le__',
 '__lt__',
 '__ne__',
 '__new__',
 '__reduce__',
 '__reduce_ex__',
 '__repr__',
 '__setattr__',
 '__sizeof__',
 '__str__',
 '__subclasshook__',
 'close',
 'commit',
 'create_aggregate',
 'create_collation',
 'create_function',
 'cursor',
 'enable_load_extension',
 'execute',
 'executemany',
 'executescript',
 'in_transaction',
 'interrupt',
 'isolation_level',
 'iterdump',
 'load_extension',
 'rollback',
 'row_factory',
 'set_authorizer',
 'set_progress_handler',
 'set_trace_callback',
 'text_factory',
 'total_changes']

In [10]:
conn

In [11]:
type(conn)

sqlite3.Connection

In [12]:
cur=conn.cursor()

In [13]:
type(cur)

sqlite3.Cursor

In [14]:
dir(cur)

['__class__',
 '__delattr__',
 '__dir__',
 '__doc__',
 '__eq__',
 '__format__',
 '__ge__',
 '__getattribute__',
 '__gt__',
 '__hash__',
 '__init__',
 '__init_subclass__',
 '__iter__',
 '__le__',
 '__lt__',
 '__ne__',
 '__new__',
 '__next__',
 '__reduce__',
 '__reduce_ex__',
 '__repr__',
 '__setattr__',
 '__sizeof__',
 '__str__',
 '__subclasshook__',
 'arraysize',
 'close',
 'connection',
 'description',
 'execute',
 'executemany',
 'executescript',
 'fetchall',
 'fetchmany',
 'fetchone',
 'lastrowid',
 'row_factory',
 'rowcount',
 'setinputsizes',
 'setoutputsize']

In [15]:
cur.execute("create table people (name_last, age)")

In [34]:
who='한효주'
age=32

In [35]:
cur.execute('insert into people values (?,?)',(who,age))

In [19]:
cur.execute("select * from people where name_last=:who and age=:age", {'who':who,'age':age})

In [26]:
print(cur.fetchone())#하나씩 꺼내옴 while쓰면 다 꺼낼때까지 꺼낸다 # 다시하면 꺼낼게 없어서 안나온다

None

In [45]:
who='한효주'
age=32

In [46]:
cur.execute('insert into people values (?,?)',(who,age))

In [47]:
who='하연수'
age=29

In [48]:
cur.execute('insert into people values (?,?)',(who,age))

In [49]:
print(cur.fetchone())

None

In [55]:
sql='insert into people values (?,?)'
curData=[('A',1),('B',2),('C',3)]

In [58]:
cur.executemany(sql,curData)

In [59]:
cur.executescript("""
create table person(
first_name text primary key,
last_name text not null);

insert into person values('name', 'kim');
""")

In [60]:
cur.execute ('select * from person')
print(cur.fetchall())

[('name', 'kim')]

In [61]:
conn.close()

In [64]:
conn=sqlite3.connect("test.txt")
print ("opened database successfully")

opened database successfully

In [66]:
conn.execute('''
CREATE TABLE COMPANY(
ID INT PRIMARY KEY NOT NULL,
NAME TEXT NOT NULL,
AGE INT NOT NULL,
ADDRESS CHAR(50),
SALARY REAL);
''')
print ("Table created successfully")

Table created successfully

In [69]:
conn.execute('drop table company')

OperationalError: no such table: company

In [71]:
conn.close()

In [72]:
conn=sqlite3.connect("test.db")
print ("opened database successfully")

opened database successfully

In [73]:
conn.execute('''
CREATE TABLE COMPANY(
ID INT PRIMARY KEY NOT NULL,
NAME TEXT NOT NULL,
AGE INT NOT NULL,
ADDRESS CHAR(50),
SALARY REAL);
''')
print ("Table created successfully")

Table created successfully

In [74]:
conn.execute("insert into company (id, name, age, address, salary)\
values(1,'paul',32,'california',200000.00)");

In [92]:
conn.execute("insert into company (id, name, age, address, salary)\
values(:id,:name,:age,:address,:salary)",
             {'id':2, 'name':'allen','age':25,'address':'texas','salary':15000.00});

In [89]:
data=[(3,'teddy',23,'norway',20000.00), 
      (4,'mark',25,'richmond',65000.00)]

In [90]:
conn.executemany("insert into company (id, name, age, address, salary)\
values(?,?,?,?,?)",data);

In [86]:
conn.executescript("""

insert into company (id, name, age, address, salary)
values(6,'teddy2',23,'norway',20000.00);""");

In [93]:
conn.commit()

In [100]:
cursor=conn.execute('select id, name, age, address, salary from company')
#                        row0    1     2      3       4   
for row in cursor:
    print('id = ',row[0])
    print('name = ',row[1])
    print('age = ',row[2])
    print('address = ',row[3])
    print('salary = ',row[4])
    print('\n')

id =  1
name =  paul
age =  32
address =  california
salary =  200000.0


id =  32
name =  allen
age =  25
address =  texas
salary =  15000.0


id =  5
name =  teddy1
age =  23
address =  norway
salary =  20000.0


id =  6
name =  teddy2
age =  23
address =  norway
salary =  20000.0


id =  3
name =  teddy
age =  23
address =  norway
salary =  20000.0


id =  4
name =  mark
age =  25
address =  richmond
salary =  65000.0


id =  2
name =  allen
age =  25
address =  texas
salary =  15000.0

In [101]:
cid=1

conn.execute('update company set salary = 25000.00 where id =:id',{'id':cid})
conn.commit()

In [102]:
print('total number of rows updated :',conn.total_changes)

total number of rows updated : 8

In [103]:
cursor=conn.execute('select id, name, age, address, salary from company')
#                        row0    1     2      3       4   
for row in cursor:
    print('id = ',row[0])
    print('name = ',row[1])
    print('age = ',row[2])
    print('address = ',row[3])
    print('salary = ',row[4])
    print('\n')

id =  1
name =  paul
age =  32
address =  california
salary =  25000.0


id =  32
name =  allen
age =  25
address =  texas
salary =  15000.0


id =  5
name =  teddy1
age =  23
address =  norway
salary =  20000.0


id =  6
name =  teddy2
age =  23
address =  norway
salary =  20000.0


id =  3
name =  teddy
age =  23
address =  norway
salary =  20000.0


id =  4
name =  mark
age =  25
address =  richmond
salary =  65000.0


id =  2
name =  allen
age =  25
address =  texas
salary =  15000.0

In [109]:
conn.execute("delete from company where ID = 2;")

cursor=conn.execute('select id, name, age, address, salary from company')
#                        row0    1     2      3       4   
for row in cursor:
    print('id = ',row[0])
    print('name = ',row[1])
    print('age = ',row[2])
    print('address = ',row[3])
    print('salary = ',row[4])
    print('\n')

id =  1
name =  paul
age =  32
address =  california
salary =  25000.0


id =  32
name =  allen
age =  25
address =  texas
salary =  15000.0


id =  5
name =  teddy1
age =  23
address =  norway
salary =  20000.0


id =  6
name =  teddy2
age =  23
address =  norway
salary =  20000.0


id =  3
name =  teddy
age =  23
address =  norway
salary =  20000.0


id =  4
name =  mark
age =  25
address =  richmond
salary =  65000.0

In [110]:
conn.commit()

In [112]:
conn.close()

In [113]:
import sqlite3 as sq1

In [114]:
con=None

In [115]:
try:
    con=sq1.connect('test.db')
    cur=con.cursor()
    cur.execute('select sqlite_version()')
    data=cur.fetchone()
    print('sqlite version :',data)
except Exception as e:
    print('error : ',e)
finally:
    if con:
        con.close()

sqlite version : ('3.21.0',)

In [119]:
con=sq1.connect('test.db')

with con:
    cur=con.cursor()
    cur.execute('create table cars(id int, name text, price int)')
    cur.execute("insert into cars values(1,'audi',52642)")
    cur.execute("insert into cars values(2,'mercedes',57127)")
    cur.execute("insert into cars values(3,'skoda',9000)")
    cur.execute("insert into cars values(4,'volvo',29000)")
    cur.execute("insert into cars values(5,'bently',350000)")
    cur.execute("insert into cars values(6,'citroen',21000)")
    cur.execute("insert into cars values(7,'hummer',41400)")
    cur.execute("insert into cars values(8,'volkswagen',21600)")

In [121]:
cars=[
    (1,'audi',52642),
    (2,'mercedes',57127),
    (3,'skoda',9000),
    (4,'volvo',29000),
    (5,'bently',350000),
    (6,'citroen',21000),
    (7,'hummer',41400),
    (8,'volkswagen',21600)
]

con=sq1.connect('test.db')

with con:
    cur=con.cursor()
    cur.execute('drop table if exists cars')
    cur.execute('create table cars(id int primary key, name text, price int)')
    cur.executemany('insert into cars values(?,?,?)',cars)

In [124]:
try:

    con=sq1.connect('test.db')
    cur=con.cursor()
    cur.executescript("""
        drop table if exists cars;
        create table cars(id int primary key, name text, price int);
        insert into cars values(1,'audi',52642);
        insert into cars values(2,'mercedes',57127);
        insert into cars values(3,'skoda',9000);
        insert into cars values(4,'volvo',29000);
        insert into cars values(5,'bently',350000);
        insert into cars values(6,'citroen',21000);
        insert into cars values(7,'hummer',41400);
        insert into cars values(8,'volkswagen',21600);
    """)

    con.commit()

except Exception as e:
    if con:
        con.rollback() 
        print ("error : ",e)
        
finally:
    if con:
        con.close()

In [128]:
con= sq1.connect(':memory:')

with con:
    cur=con.cursor()
    cur.execute("create table friends(id int primary key, name text);")
    cur.execute("insert into friends(name) values('tom');")
    cur.execute("insert into friends(name) values('rebecca');")
    cur.execute("insert into friends(name) values('jim');")
    cur.execute("insert into friends(name) values('robert');")
    
    lid = cur.lastrowid
    print("the last id of the inserted row is ",lid)

the last id of the inserted row is  4

In [129]:
con=sq1.connect('test.db')

with con:
    cur=con.cursor()
    cur.execute("select * from cars")
    
    while True:
        row = cur.fetchone()
        if row==None:
            break
            
        print(row[0],row[1],row[2])

1 audi 52642
2 mercedes 57127
3 skoda 9000
4 volvo 29000
5 bently 350000
6 citroen 21000
7 hummer 41400
8 volkswagen 21600

In [132]:
con=sq1.connect('test.db')

with con:
    con.row_factory=sq1.Row
    cur=con.cursor()
    cur.execute("select * from cars")
    
    
    rows= cur.fetchall()
    for row in rows:        
        print(row["id"],row["name"],row["price"])

1 audi 52642
2 mercedes 57127
3 skoda 9000
4 volvo 29000
5 bently 350000
6 citroen 21000
7 hummer 41400
8 volkswagen 21600

In [135]:
uid =1
uPrice=62300

con = sq1.connect('test.db')

with con:
    cur=con.cursor()
    cur.execute("update cars set price=? where id=?", (uPrice,uid))
    
    print("number of rows updated:",cur.rowcount)

number of rows updated: 1

In [137]:
uid =4

con = sq1.connect('test.db')

with con:
    cur=con.cursor()
    cur.execute("select name, price from cars where id=:id",{"id":uid})
    
    row =cur.fetchone()
    print(row[0],row[1])

volvo 29000